tap "charmbracelet/tap"
tap "dart-lang/dart"
tap "dwarvesf/tap"
tap "ethereum/ethereum"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "libpng"
brew "ca-certificates"
brew "arping"
brew "autoconf"
brew "autojump"
brew "automake"
brew "azure-cli"
brew "bat"
brew "blueutil"
brew "cmake"
brew "code-minimap"
brew "gettext"
brew "libtool"
brew "gmp"
brew "php"
brew "composer"
brew "coreutils"
brew "deno"
brew "dnsmasq"
brew "docker", link: false
brew "node"
brew "eslint"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "gcc@8"
brew "gh"
brew "git-delta"
brew "glib"
brew "glow"
brew "gnu-sed"
brew "pkg-config"
brew "go"
brew "gopls"
brew "grip"
brew "hashcat"
brew "lua"
brew "highlight"
brew "ncurses"
brew "htop"
brew "hub"
brew "hugo"
brew "inetutils"
brew "jenv"
brew "joplin"
brew "jq"
brew "just"
brew "libksba"
brew "libproxy"
brew "libyubikey", link: false
brew "lima"
brew "lsd"
brew "lua@5.3"
brew "luajit"
brew "luarocks"
brew "lynx"
brew "ruby"
brew "macvim"
brew "openjdk"
brew "maven"
brew "mercurial"
brew "mono"
brew "protobuf"
brew "mosh"
brew "zlib"
brew "mysql", restart_service: true
brew "neovim"
brew "nginx"
brew "ngrep"
brew "nmap"
brew "nushell"
brew "nvm"
brew "opam"
brew "ophcrack"
brew "pacvim"
brew "ykclient", link: false
brew "ykpers"
brew "pam_yubico"
brew "pandoc"
brew "pari"
brew "php@7.4", restart_service: true
brew "pipx"
brew "postgresql@14"
brew "pv"
brew "python@3.8", link: false
brew "python@3.9"
brew "qt"
brew "ragel"
brew "ripgrep"
brew "sbt"
brew "scons"
brew "sdl2"
brew "shellcheck"
brew "shfmt"
brew "silicon"
brew "solidity", link: false
brew "ssh-copy-id", link: true
brew "stormssh"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "uncrustify"
brew "universal-ctags"
brew "wget"
brew "yajl"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "charmbracelet/tap/gum"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
cask "alacritty"
cask "font-hack-nerd-font"
cask "gifcapture"
cask "graphiql"
cask "hammerspoon"
cask "hyper"
cask "ipfs"
cask "keepingyouawake"
cask "keycastr"
cask "libreoffice"
cask "postman"
cask "seaglass"
cask "syntax-highlight"
cask "vimmotion"
cask "vv"
cask "wireshark"
cask "xquartz"
