tap "charmbracelet/tap"
tap "dart-lang/dart"
tap "dwarvesf/tap"
tap "ethereum/ethereum"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/gitstatus"
tap "romkatv/powerlevel10k"
brew "bat"
brew "python@3.10"
brew "solc-select"
brew "echidna"
brew "fzf"
brew "gcc"
brew "gcc@11"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "unbound"
brew "go"
brew "gum"
brew "gzip"
brew "hey"
brew "just"
brew "llvm"
brew "lua"
brew "luarocks"
brew "neovim"
brew "nmap"
brew "node"
brew "pre-commit"
brew "qemu"
brew "ripgrep"
brew "ruby"
brew "rustscan"
brew "silicon"
brew "tmate"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "heroku/brew/heroku"
brew "romkatv/gitstatus/gitstatus"
cask "deskreen"
cask "fig"
cask "vagrant"
