tap "charmbracelet/tap"
tap "dwarvesf/tap"
tap "hashicorp/tap"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "romkatv/gitstatus"
tap "romkatv/powerlevel10k"
brew "bat"
brew "crytic-compile", link: false
brew "gmp"
brew "slither-analyzer", link: false
brew "echidna"
brew "fd"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gcc@11"
brew "gcc@12"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "gum"
brew "gzip"
brew "hey"
brew "jpegoptim"
brew "just"
brew "lazygit"
brew "libgit2"
brew "llvm"
brew "lua"
brew "luarocks"
brew "node"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk@17"
brew "pngquant"
brew "pre-commit"
brew "prettier", link: false
brew "python-argcomplete", link: false
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "repomix"
brew "ripgrep"
brew "ruby"
brew "rustscan"
brew "silicon"
brew "solc-select", link: false
brew "tmate"
brew "tree"
brew "virtualenv", link: false
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "romkatv/gitstatus/gitstatus"
cask "android-studio"
cask "deskreen"
cask "font-hack-nerd-font"
cask "jordanbaird-ice"
cask "ngrok"
cask "qlcolorcode"
cask "sequel-ace"
cask "vagrant"
vscode "ajkhoury.beautiful-light"
vscode "ajshort.include-autocomplete"
vscode "aramok.aramoks-black"
vscode "bmalehorn.shell-syntax"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "cstrap.flask-snippets"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fallenwood.viml"
vscode "fehey.brackets-light-pro"
vscode "felixfbecker.php-intellisense"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hars.cppsnippets"
vscode "henrytsz.nvim"
vscode "hyzeta.vscode-theme-github-light"
vscode "ionutvmi.path-autocomplete"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "leojhonsong.ccpp-extension-pack"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.anaconda-extension-pack"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nomicfoundation.hardhat-solidity"
vscode "notskm.clang-tidy"
vscode "nrwl.angular-console"
vscode "numso.prettier-standard-vscode"
vscode "nur.just-black"
vscode "pkosta2005.heroku-command"
vscode "pythagoratechnologies.gpt-pilot-vs-code"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-icons-mac"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zhouronghui.propertylist"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"
